Repository: Bradley39e/turtleblocksjs
Catalog: po/*.po
Languages: sq

source: clear
sq: pastroje

source: forward
sq: përpara

source: right
sq: djathtas

source: back
sq: mbrapsht

source: left
sq: majtas

source: arc
sq: hark

source: angle
sq: kënd

source: radius
sq: rreze

source: set heading
sq: caktoni drejtim

source: heading
sq: drejtim

source: set xy
sq: caktoni xy

source: set color
sq: caktoni ngjyrë

source: color
sq: ngjyrë

source: set hue
sq: caktoni ton

source: set shade
sq: caktoni hije

source: shade
sq: hije

source: set grey
sq: caktoni gri

source: grey
sq: gri

source: set pen size
sq: caktoni madhësi lapsi

source: pen size
sq: madhësi lapsi

source: pen up
sq: lapsi lart

source: pen down
sq: lapsi poshtë

source: begin fill
sq: fillo ngjyrosjen

source: end fill
sq: përfundo ngjyrosjen

source: background
sq: prapaskenë

source: random
sq: kuturu

source: max
sq: maks.

source: store in
sq: depozitoje në

source: name
sq: emër

source: value
sq: vlerë

source: box
sq: kuti

source: action
sq: veprim

source: add 1 to
sq: shto 1 te

source: add
sq: shtoje

source: to
sq: te

source: speak
sq: flisni

source: show
sq: shfaqe

source: size
sq: madhësi

source: text
sq: tekst

source: image
sq: figurë

source: stop media
sq: ndale median

source: repeat
sq: përsërite

source: forever
sq: përgjithmonë

source: stop
sq: ndale

source: if
sq: nëse

source: then
sq: atëherë

source: until
sq: derisa

source: wait for
sq: prit për

source: while
sq: teksa

source: wait
sq: prit

source: print
sq: shtype

source: time
sq: kohë

source: mouse x
sq: x miu

source: mouse y
sq: y miu

source: mouse button
sq: buton miu

source: keyboard
sq: tastierë

source: pixel color
sq: ngjyrë pikseli

source: unknown
sq: e panjohur

source: Welcome to Turtle Blocks
sq: Mirë se vini te Blloqe Breshke

source: Palette buttons
sq: Butona palete

source: This toolbar contains the palette buttons: click to show or hide the palettes of blocks (Turtle, Pen, Numbers, Boolean, Flow, Blocks, Media, Sensors, and Extras). Once open, you can drag blocks from the palettes onto the canvas to use them.
sq: Ky panel përmban butona paletash: klikojini që të shfaqni ose fshihni paleta blloqesh (Breshkë, Penë, Numra, Buleane, Flow, Blloqe, Media, Ndijues, dhe Ekstra). Pasi të hapet, mund të tërhiqni blloqe nga paletat te kanavaca, për t’i përdorur.

source: Expand/collapse toolbar
sq: Zgjeroje/tkurre panelin

source: This button opens and closes the primary toolbar.
sq: Ky buton hap dhe mbyll panelin parësor.

source: Run fast
sq: Xhiroje shpejt

source: Click to run the project in fast mode.
sq: Klikoni që projekti të xhirohet nën mënyrën shpejt.

source: Run slow
sq: Xhiroje ngadalë

source: Click to run the project in slow mode.
sq: Klikoni që projekti të xhirohet nën mënyrën ngadalë.

source: Run step by step
sq: Xhiroje hap pas hapi

source: Click to run the project step by step.
sq: Klikoni që projekti të xhirohet hap pas hapi.

source: Stop
sq: Ndale

source: Stop the current project.
sq: Ndale projektin e tanishëm.

source: Clean
sq: Pastroje

source: Clear the screen and return the turtles to their initial positions.
sq: Pastroje ekranin dhe ktheji breshkat te pozicionet e tyre fillestare.

source: Show/hide palettes
sq: Shfaq/fshih paleta

source: Hide or show the block palettes.
sq: Shfaqni ose fshihni paleta blloqesh.

source: Show/hide blocks
sq: Shfaq/fshih blloqe

source: Hide or show the blocks and the palettes.
sq: Shfaqni ose fshihni paleta dhe blloqe.

source: Expand/collapse collapsable blocks
sq: Zgjeroni/tkurrni blloqe që mund të tkurren

source: Expand or collapse stacks of blocks, e.g, start and action stacks.
sq: Zgjeroni ose tkurrni grupe blloqesh, f.v., grupe fillimi dhe veprimi.

source: Help
sq: Ndihmë

source: Show these messages.
sq: Shfaq këto mesazhe.

source: Expand/collapse option toolbar
sq: Zgjeroni/tkurrni panel mundësish

source: Click this button to expand or collapse the auxillary toolbar.
sq: Klikoni këtë buton që të zgjerohet/tkurret paneli ndihmës.

source: Paste
sq: Ngjite

source: The paste button is enabled then there are blocks copied onto the clipboard.
sq: Butoni i ngjitjeve është aktiv kur ka blloqe të kopjuar në të papastër.

source: Cartesian
sq: Karteziane

source: Show or hide a Cartesian-coordinate grid.
sq: Shfaqni ose fshihni një rrjetë koordinatash karteziane.

source: Polar
sq: Polare

source: Show or hide a polar-coordinate grid.
sq: Shfaqni ose fshihni një rrjetë koordinatash polare.

source: Load samples from server
sq: Ngarko shembuj prej shërbyesi

source: This button opens a viewer for loading example projects.
sq: Ky buton hap një parës për ngarkim projektesh shembull.

source: Load project from file
sq: Ngarko projekt prej kartele

source: You can also load projects from the file system.
sq: Projekte mund të ngarkoni edhe që nga sistemi i kartelave.

source: Load plugin from file
sq: Ngarko shtojcë prej kartele

source: You can load new blocks from the file system.
sq: Blloqe të rinj mund të ngarkoni që nga sistemi i kartelave.

source: Delete all
sq: Fshiji krejt

source: Remove all content on the canvas, including the blocks.
sq: Hiq prej kanavacës krejt lëndën, përfshi blloqet.

source: Undo
sq: Zhbëje

source: Restore blocks from the trash.
sq: Rikthe blloqe prej hedhurinave.

source: Save project
sq: Ruaje projektin

source: Save your project to a server.
sq: Ruajeni projektin tuaj te një shërbyes.

source: Congratulations.
sq: Përgëzime.

source: You have finished the tour. Please enjoy Turtle Blocks!
sq: E mbaruat turin. Kënaquni me Turtle Blocks!

source: hide blocks
sq: fshihi blloqet

source: loudness
sq: volum

source: publish
sq: botoje

source: comment
sq: koment

source: play back
sq: luaje sërish

source: save svg
sq: ruaj svg-në

source: title
sq: titull

source: show blocks
sq: shfaqi blloqet

source: stop play
sq: ndale luajtjen

source: turtle
sq: breshkë

source: pen
sq: penë

source: number
sq: numër

source: boolean
sq: buleane

source: flow
sq: rrjedhë

source: blocks
sq: blloqe

source: sensors
sq: ndijues

source: extras
sq: ekstra

source: open file
sq: hape kartelën

source: motion z
sq: lëvizje në boshtin z

source: motion y
sq: lëvizje në boshtin y

source: motion x
sq: lëvizje në boshtin x

source: from
sq: nga

source: currency
sq: monedhë

source: Google map
sq: Hartë nga Google

source: coordinates
sq: koordinata

source: zoom factor
sq: faktor zmadhimi/zvogëlimi

source: zoom
sq: zmadhim/zvogëlim

source: latitude
sq: gjerësia gjeografike

source: longitude
sq: gjatësia gjeografike

source: power
sq: në fuqi

source: base
sq: baza

source: exp
sq: eksponenti

source: floor
sq: dysheme

source: ceiling
sq: tavan

source: degrees
sq: gradë

source: to degrees
sq: në gradë

source: radians
sq: radianë

source: to radians
sq: në radian

source: maths
sq: matematikë

source: cheese
sq: djathë

source: apple
sq: mollë

source: get fat
sq: merrni yndyra

source: fish
sq: peshk

source: get calories
sq: merrni kalori

source: protein
sq: proteinë

source: chicken
sq: pulë

source: digest meal
sq: tretni ushqimin

source: get fiber
sq: merrni fibra

source: carbs
sq: karbohidrate

source: eat
sq: hani

source: rice and beans
sq: oriz dhe fasule

source: orange
sq: portokalle

source: banana
sq: banane

source: fiber
sq: fibër

source: corn
sq: misër

source: fat
sq: yndyrë

source: get carbs
sq: merrni karbohidrate

source: water
sq: ujë

source: cookie
sq: biskotë

source: sweet potato
sq: patate e ëmbël

source: broccoli
sq: brokoli

source: wheat bread
sq: bukë e bardhë

source: tomato
sq: domate

source: beef
sq: mish viçi

source: potato
sq: patate

source: calories
sq: kalori

source: get name
sq: merr emrin

source: cake
sq: tortë

source: get protein
sq: merrni proteina

source: food
sq: ushqim

source: sense left
sq: ndijim majtas

source: see distance
sq: shihni largësi

source: sense right
sq: ndijim djathtas

source: sing
sq: këndoni

source: note
sq: notë

source: duration
sq: kohëzgjatje

source: move
sq: lëviz

source: blink (ms)
sq: xixëllim (ms)

source: set lang
sq: caktoni gjuhë

source: source
sq: burim

source: target
sq: objektiv

source: translate
sq: përkthejeni

source: hello
sq: tungjatjeta

source: detect lang
sq: zbulo gjuhën

source: turtle x
sq: x breshke

source: turtle y
sq: y breshke

source: stop turtle
sq: ndale breshkën

source: turtle name
sq: emri i breshkës

source: start turtle
sq: nise breshkën

source: forecast
sq: parashikim moti

source: city
sq: qytet

source: day
sq: ditë

source: low
sq: e ulët

source: high
sq: e lartë
