Repository: Bradley39e/turtleblocksjs
Catalog: po/gug.po
Languages: gug

source: clear
gug: Mopotĩ.

source: forward
gug: Tenondépe.

source: right
gug: Akatúa.

source: back
gug: Tapykuépe.

source: left
gug: Asúpe.

source: arc
gug: Yvyrapã.

source: angle
gug: Takamby.

source: radius
gug: Mbyteguisẽha.

source: set heading
gug: Amoĩ tape.

source: heading
gug: Tape.

source: set xy
gug: Amoĩ xy.

source: set color
gug: Amoĩ sa'y.

source: color
gug: Sa'y.

source: set hue
gug: Amoĩ sa'y ambuevýva.

source: set shade
gug: Amoĩ kuarahy'ã.

source: shade
gug: Kuarahy'ã.

source: set grey
gug: Amoĩ hungy.

source: grey
gug: Hungy.

source: set pen size
gug: Amoĩ tague.

source: pen size
gug: Tuichakue tague.

source: pen up
gug: Jupi tague.

source: pen down
gug: Guejy tague.

source: begin fill
gug: Ñepyru myenyhe.

source: end fill
gug: Japopa myenyhe.

source: background
gug: Myenyhe Tendahesaperã.

source: random
gug: Sapy'agua.

source: sqrt
gug: Tapo.

source: mod
gug: Pehẽngue.

source: and
gug: Ha.

source: or
gug: Tera.

source: not
gug: Nahániri.

source: store in
gug: Ñongatu pe.

source: name
gug: Téra.

source: value
gug: Py'aguasu.

source: box
gug: Ryru.

source: action
gug: Tembiapo.

source: do
gug: Japo.

source: start
gug: Ñepyrũ.

source: add 1 to
gug: Moîve 1 pe.

source: add
gug: Moĩve.

source: to
gug: Pe.

source: speak
gug: Ñe'ẽ.

source: show
gug: Hechauka.

source: size
gug: Tuichakue.

source: obj
gug: Mba'e.

source: text
gug: Tembihai.

source: shell
gug: Ape.

source: image
gug: Ta'anga.

source: stop media
gug: Mombyta Pytyvõrã..

source: repeat
gug: Ha'ejevy.

source: forever
gug: Akói rehe.

source: stop
gug: Mombyta.

source: if
gug: Hẽe.

source: then
gug: Upéicharõ.

source: until
gug: Peve.

source: wait for
gug: Ha'arõ peve.

source: while
gug: Jave.

source: else
gug: Pokatu.

source: wait
gug: Ha'arõ.

source: print
gug: Kuatiajopy.

source: time
gug: Ára.

source: mouse x
gug: Oisambyhy.

source: mouse y
gug: Oisambyhy y.

source: mouse button
gug: Botõ anguja mbae.

source: keyboard
gug: Votõ.

source: pixel color
gug: Sa'y pixel.

source: unknown
gug: Jekuaa'ỹva.

source: Welcome to Turtle Blocks
gug: Tereg̃uaheporãite karumbe amongora pe.

source: Turtle Blocks is a Logo-inspired turtle that draws colorful pictures with snap-together visual-programming blocks.
gug: Karumbe amongora ha'e peteĩ karumbe py'amongetaha pe ñe'ẽ ha ojapo ta'ãngahaipyrekuera mbosa'ypapyre ypýpe amongora ndive japopa jejaporã ojehecháva.

source: Palette buttons
gug: Votõkuera tatapyñaha.

source: This toolbar contains the palette buttons: click to show or hide the palettes of blocks (Turtle, Pen, Numbers, Boolean, Flow, Blocks, Media, Sensors, and Extras). Once open, you can drag blocks from the palettes onto the canvas to use them.
gug: Ko pehẽ tembipuru jejoko votõkuera tatapyñaha: Háse click hechauka haguã mo'ã tatapyñaha amongora (Karumbe, Haiha, Papahakuera, Booleanos, Pytyvõrã, Tembiporu ha Ijykepegua). Peteĩ jevy jái, ija guive mbotyryry amongora tatapyñaha pe ao oipuru haguã.

source: Expand/collapse toolbar
gug: Moasãi terã mboapa pehẽ.

source: This button opens and closes the primary toolbar.
gug: Ko votõ oipe'a ha omboty pe pehẽ tembipuru tenondevegua.

source: Run fast
gug: Japo pya'e.

source: Click to run the project in fast mode.
gug: Ejapo click japopa haguã tape pe kokatu pya´e.

source: Run slow
gug: Japo mbeguekatu.

source: Click to run the project in slow mode.
gug: Ejapo click japopa haguã tape pe kokatu mbegue.

source: Run step by step
gug: Japo pyrũ pe pyrũ.

source: Click to run the project step by step.
gug: Ejapo click japopa haguã tape pe kokatu pyrũ pe pyrũ.

source: Stop
gug: Mombyta.

source: Stop the current project.
gug: Mombyta pe jejaporâ ko'agagua.

source: Clean
gug: Mopotî.

source: Clear the screen and return the turtles to their initial positions.
gug: Mbogue tendahesaperã ha jujey karumbekuera tenda ypykuera.

source: Show/hide palettes
gug: Hechauka mo'ã pe tatapyñaha.

source: Hide or show the block palettes.
gug: Mo'ã térâ hechauka pe tatapyñaha amongora.

source: Show/hide blocks
gug: Hechauka terá mo'ã pe amongorakuera.

source: Hide or show the blocks and the palettes.
gug: Mo'ã térâ hechauka pe amongora ha tatapyñahakuera.

source: Expand/collapse collapsable blocks
gug: Moasãi terá mboapa ko amongora je'ara.

source: Expand or collapse stacks of blocks, e.g, start and action stacks.
gug: Moasãi terá mboapa ko amongora je'ara, icha techapyrâgui pe amongora ñepyru ha pe tembiapo.

source: Help
gug: Pytyvô.

source: Show these messages.
gug: Pe hechauka ko ñe'émondo.

source: Expand/collapse option toolbar
gug: Moasãi/mboapa ko pehẽ rekokuaa.

source: Click this button to expand or collapse the auxillary toolbar.
gug: Ejapo click ko votó rehe moasãi/mboapa ko pehẽ tembipuru pytyvõhára.

source: Paste
gug: Mboja.

source: The paste button is enabled then there are blocks copied onto the clipboard.
gug: Ko votõ mbojaha oî kyre'ỹ, terã sapy'agua oĩ amongora haijevypapyre pe kuatiareko.

source: Cartesian
gug: Cartesiano.

source: Show or hide a Cartesian-coordinate grid.
gug: Hechauka terã mo'ã koty'i pe hai ñeñocartesianas.

source: Polar
gug: Tu'ã.

source: Show or hide a polar-coordinate grid.
gug: Hechauka terã mo'ã ko yvesé pe haiñeno tu’ãkuera.

source: Load samples from server
gug: Hupi techapyrãkuera pe pytyvô guive.

source: This button opens a viewer for loading example projects.
gug: Ko votõ oipe'a tendahesaperã jokuapy jejaporâkuera techapyragui.

source: Load project from file
gug: Hupi jejaporâ ñongatuha guive.

source: You can also load projects from the file system.
gug: Avei ikatu ehupi jejapora mbo'e guive pe ñongatuha.

source: Load plugin from file
gug: Hupi plugin ñongatuha guive.

source: You can load new blocks from the file system.
gug: Nde ikatu ehupi pyahu amongora peteĩ ñongatuha guive.

source: Delete all
gug: Mbogue pa.

source: Remove all content on the canvas, including the blocks.
gug: Aipe'a pa pe jokopapyre canvas, emoinge ichupe ko mongorakuera.

source: Undo
gug: Mosarambi.

source: Restore blocks from the trash.
gug: Myatyrõ mongorakuera pe kuatiarenda.

source: Save project
gug: Ñongatu jejapora.

source: Save your project to a server.
gug: Añongatu jejapora pytyvô pe.

source: Congratulations.
gug: Roguerohory.

source: You have finished the tour. Please enjoy Turtle Blocks!
gug: Opama pe tour. Ñaha'arõ ha reporuvy'a karumbe mongora.

source: hide blocks
gug: Mo'ã mongorakuera.

source: loudness
gug: Tuichakue.

source: publish
gug: Mbojekuaa.

source: comment
gug: Myesakã.

source: play back
gug: Haijevy.

source: save svg
gug: Ñongatu mba'éicha SVG.

source: title
gug: Téra.

source: eval
gug: Jakatura´ã.

source: show blocks
gug: Hechauka mongorakuera.

source: stop play
gug: Mombyta.

source: turtle
gug: Karumbe.

source: pen
gug: Tague.

source: number
gug: Papaha.

source: boolean
gug: Booleano.

source: flow
gug: Syry.

source: blocks
gug: Mongorakuera.

source: media
gug: Pytyvõrã.

source: sensors
gug: Mba'e.

source: extras
gug: Ijykepegua.

source: open file
gug: Pe'a ñongatuha.

source: motion z
gug: Z Mýi.

source: motion y
gug: Y Mỹi.

source: motion x
gug: X Mỹí.

source: from
gug: Guive.

source: define
gug: Myesakã.

source: stock price
gug: Py'aguasu tembiapogui.

source: currency
gug: Pirapire.

source: Google map
gug: Yvy ra'anga googlegui.

source: coordinates
gug: Hai ñeno.

source: zoom factor
gug: Ypy zoomgui.

source: latitude
gug: Pekue.

source: longitude
gug: Pukukue.

source: show heap
gug: Hechauka aty.

source: pop
gug: Nohẽ.

source: empty heap
gug: Monandi aty.

source: save heap
gug: Ñongatu aty.

source: load heap
gug: Hupi aty.

source: push
gug: Mbyaty.

source: logic
gug: Kuaa rape.

source: power
gug: Ikatu.

source: base
gug: Topyta.

source: floor
gug: Yvy atã.

source: ceiling
gug: Ogahoja.

source: degrees
gug: Mbovykuera.

source: to degrees
gug: Pe mbovykuera.

source: radians
gug: Radianes.

source: to radians
gug: Pe radianes.

source: maths
gug: Mba'ekuaa porã.

source: cheese
gug: Kesu.

source: apple
gug: Masã.

source: get fat
gug: Hupytu kyrakuera.

source: fish
gug: Pira.

source: get calories
gug: Hupytu ku'erã.

source: protein
gug: Guypegua.

source: chicken
gug: Ryguasu.

source: digest meal
gug: Mboguapy.

source: get fiber
gug: Hupytu tyvi.

source: carbs
gug: Ku'erã.

source: eat
gug: Karu.

source: rice and beans
gug: Avati'i ha kumanda.

source: orange
gug: Narã.

source: banana
gug: Pakova.

source: tamale
gug: Tamal.

source: fiber
gug: Tyvi.

source: corn
gug: Avati.

source: fat
gug: Kyra.

source: get carbs
gug: Hupyty ku'erã.

source: water
gug: Y.

source: cookie
gug: Mbujape.

source: sweet potato
gug: Jety.

source: broccoli
gug: Brócoli.

source: wheat bread
gug: Tembi'u týra.

source: tomato
gug: Toma.

source: beef
gug: Mymba ro'o.

source: potato
gug: Yvy'a.

source: calories
gug: Ku'erã.

source: get name
gug: Hupytu téra.

source: cake
gug: Chipa so'o.

source: get protein
gug: Hupity guypegua.

source: food
gug: Hi'upy.

source: eatme
gug: Che umina.

source: sense left
gug: Andupáva asúpe.

source: see distance
gug: Andupava mbyryguĩ.

source: sense right
gug: Andupáva akatúa.

source: sing
gug: Purahéi.

source: note
gug: Ohesaho.

source: duration
gug: Hi'are.

source: move
gug: Mongu'e.

source: blink (ms)
gug: Mimbi (ms).

source: set lang
gug: Moambue ñe'ê.

source: source
gug: Ñepyrũ.

source: target
gug: Amondo.

source: translate
gug: Mbojere.

source: hello
gug: Maitei.

source: detect lang
gug: Juhuka ñe'ê.

source: turtle x
gug: Karumbe x.

source: turtle y
gug: Karumbe y.

source: stop turtle
gug: Mombyta.

source: turtle name
gug: Mbohéra jey karumbe.

source: start turtle
gug: Ñepyrû karumbe.

source: forecast
gug: Ha'uvõ.

source: city
gug: Táva.

source: day
gug: Ára.

source: low
gug: Karape.

source: high
gug: Yvate.
